InformationRegisters/ра_ПравилаОпределенияОбъемовРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ра_ПравилаОпределенияОбъемовРабот</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_ObemyRabot</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МестоВыявления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_MestaVyyavleniyaNesootvetstvij</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Повторяемость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВлияниеНаЭксплуатацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВлияниеНаГрафик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВлияниеНаБюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ra_ObemyRabot.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ra_ObemyRabot</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>D3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>D6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>D8</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ра_ПравилаОпределенияОбъемовРабот/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ОпределитьОбъемРабот(МестоВыявления, Повторяемость, ВлияниеНаЭксплуатацию, ВлияниеНаГрафик, ВлияниеНаБюджет) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("МестоВыявления", МестоВыявления);
	Параметры.Вставить("Повторяемость", Повторяемость);
	Параметры.Вставить("ВлияниеНаЭксплуатацию", ВлияниеНаЭксплуатацию);
	Параметры.Вставить("ВлияниеНаГрафик", ВлияниеНаГрафик);
	Параметры.Вставить("ВлияниеНаБюджет", ВлияниеНаБюджет);
	
	Результат = РегистрыСведений.ра_ПравилаОпределенияОбъемовРабот.Получить(Параметры);
	
	Если ЗначениеЗаполнено(Результат.ОбъемРабот) Тогда
		Возврат Результат.ОбъемРабот;
	Иначе
		Возврат Перечисления.ra_ObemyRabot.D3;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
